#ifndef ALL_H
#define ALL_H

//******************************************************************************
//
//
//      all.h
//
//
//******************************************************************************

//------< インクルード >---------------------------------------------------------
#include "../GameLib/game_lib.h"

#include "common.h"
//------------------------------------------------------------------------------
// TODO:04 scene_title.hをインクルードする
//------------------------------------------------------------------------------
#include "scene_game.h"
#include "scene_title.h"
#include "scene_resulet.h"

// namespace
using namespace GameLib;
using namespace input;

#endif//ALL_H
