//******************************************************************************
//
//
//      scene_resulet
//
//
//******************************************************************************

//----< インクルード >-----------------------------------------------------------
#include "all.h"

//------< 定数 >----------------------------------------------------------------


//------< 変数 >----------------------------------------------------------------
int resulet_state = 0;     // 状態
int resulet_timer = 0;     // タイマー



//--------------------------------------
//  初期設定
//--------------------------------------
void resulet_init()
{
	resulet_state = 0;
	resulet_timer = 0;
}

//--------------------------------------
//  更新処理
//--------------------------------------
void resulet_update()
{
	switch (resulet_state)
	{
	case 0:
		//////// 初期設定 ////////

		resulet_state++;
		/*fallthrough*/
	case 1:
		//////// パラメータの設定 ////////

		// ブレンドモードの設定
		GameLib::setBlendMode(Blender::BS_ALPHA);

		resulet_state++;
		/*fallthrough*/
	case 2:
		//////// 通常時 ////////
		if (TRG(0) & PAD_SELECT)
		{
			nextScene = SCENE_TITLE;
			break;
		}


		break;
	}

	resulet_timer++;
}

//--------------------------------------
//  描画処理
//--------------------------------------
void resulet_render()
{
	// 画面をクリアする
	GameLib::clear(0.0f, 1.0f, 0.0f);


	font::textOut(1, "PRESS BackSpace KEY", 0, 0, 1, 1);

}

//--------------------------------------
//  終了処理
//--------------------------------------
void resulet_deinit()
{


}
