//******************************************************************************
//
//
//      scene_game
//
//
//******************************************************************************

//----< インクルード >-----------------------------------------------------------
#include "all.h"
#include "player.h"
#include "enemy.h"

//------< 定数 >----------------------------------------------------------------


//------< 変数 >----------------------------------------------------------------
int game_state = 0;     // 状態
int game_timer = 0;     // タイマー

//--------------------------------------
//  初期設定
//--------------------------------------
void game_init()
{
	game_state = 0;
	game_timer = 0;
	player_init();
	enemy_init();
}

//--------------------------------------
//  更新処理
//--------------------------------------
void game_update()
{
	switch (game_state)
	{
	case 0:
		//////// 初期設定 ////////

		game_state++;
		/*fallthrough*/
	case 1:
		//////// パラメータの設定 ////////

		// ブレンドモードの設定
		GameLib::setBlendMode(Blender::BS_ALPHA);

		game_state++;
		/*fallthrough*/
	case 2:
		//////// 通常時 ////////
		
		player_update();
		enemy_update();
		
		if (TRG(0) & PAD_START)
		{
			nextScene = SCENE_RESULT;
			break;
		}

		break;
	}

	game_timer++;
}

//--------------------------------------
//  描画処理
//--------------------------------------
void game_render()
{
	// 画面をクリアする
	GameLib::clear(0.2f, 0.0f, 0.75f);


	player_render();
	enemy_render();
	
	font::textOut(2, "GAME", 100, 200, 2, 2);

}

//--------------------------------------
//  終了処理
//--------------------------------------
void game_deinit()
{
	player_deinit();
	enemy_deinit();
}
