//******************************************************************************
//
//
//      scene_title
//
//
//******************************************************************************

//----< インクルード >-----------------------------------------------------------
#include "all.h"



//------< 定数 >----------------------------------------------------------------


//------< 変数 >----------------------------------------------------------------
int title_state = 0;     // 状態
int title_timer = 0;     // タイマー



//--------------------------------------
//  初期設定
//--------------------------------------
void title_init()
{
	title_state = 0;
	title_timer = 0;
}

//--------------------------------------
//  更新処理
//--------------------------------------
void title_update()
{
	switch (title_state)
	{
	case 0:
		//////// 初期設定 ////////

		title_state++;
		/*fallthrough*/
	case 1:
		//////// パラメータの設定 ////////

		// ブレンドモードの設定
		GameLib::setBlendMode(Blender::BS_ALPHA);

		title_state++;
		/*fallthrough*/
	case 2:
		//////// 通常時 ////////
		if (TRG(0) & PAD_TRG1)
		{
			nextScene = SCENE_GAME;
			break;
		}

		


		break;
	}

	title_timer++;
}

//--------------------------------------
//  描画処理
//--------------------------------------
void title_render()
{
	// 画面をクリアする
	GameLib::clear(0.2f, 0.2f, 0.2f);


	font::textOut(1, "GAME", 640, 200);
	if ((title_timer / 20) % 2 == 0)
	{
		font::textOut(1, "PRESS SPACE KEY", 640, 300);
	}
}

//--------------------------------------
//  終了処理
//--------------------------------------
void title_deinit()
{


}
